whiteway11890/PIC32_Dev/Firmware/Ethernet/src/ENC28J60.c
/*********************************************************************
 *
 *	Medium Access Control (MAC) Layer for Microchip ENC28J60
 *  Module for Microchip TCP/IP Stack
 *	 -Provides access to ENC28J60 Ethernet controller
 *	 -Reference: ENC28J60 Data sheet, IEEE 802.3 Standard
 *
 *********************************************************************
 * FileName:        ENC28J60.c
 * Dependencies:    ENC28J60.h
 *					MAC.h
 *					string.h
 *                  StackTsk.h
 *                  Helpers.h
 *					Delay.h
 * Processor:       PIC18, PIC24F, PIC24H, dsPIC30F, dsPIC33F
 * Complier:        Microchip C18 v3.02 or higher
 *					Microchip C30 v2.01 or higher
 * Company:         Microchip Technology, Inc.
 *
 * Software License Agreement
 *
 * This software is owned by Microchip Technology Inc. ("Microchip") 
 * and is supplied to you for use exclusively as described in the 
 * associated software agreement.  This software is protected by 
 * software and other intellectual property laws.  Any use in 
 * violation of the software license may subject the user to criminal 
 * sanctions as well as civil liability.  Copyright 2006 Microchip
 * Technology Inc.  All rights reserved.
 *
 * This software is provided "AS IS."  MICROCHIP DISCLAIMS ALL 
 * WARRANTIES, EXPRESS, IMPLIED, STATUTORY OR OTHERWISE, NOT LIMITED 
 * TO MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, AND 
 * INFRINGEMENT.  Microchip shall in no event be liable for special, 
 * incidental, or consequential damages.
 *
 *
 * Author               Date   		Comment
 *~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
 * Howard Schlunder		6/28/04	Original
 * Howard Schlunder		10/8/04	Cleanup
 * Howard Schlunder		10/19/04 Small optimizations and more cleanup
 * Howard Schlunder		11/29/04 Added Set/GetCLKOUT
 * Howard Schlunder		12/23/05 Added B1 silicon errata workarounds
 * Howard Schlunder		1/09/06	Added comments and minor mods
 * Howard Schlunder		1/18/06 Added more silicon errata workarounds
 * Howard Schlunder		6/16/06 Synchronized with PIC18F97J60 code
 * Howard Schlunder		7/17/06 Updated TestMemory() for C30
 * Howard Schlunder		8/07/06	Added SetRXHashTableEntry() function
 ********************************************************************/
#define __ENC28J60_C

#include "tcpip.h"

#include <xc.h>
#include <p32xxxx.h>

// Make sure that this hardware profile has an ENC28J60 in it
#if defined(ENC_CS_TRIS) && !defined(STACK_USE_SLIP)


/** D E F I N I T I O N S ****************************************************/
// IMPORTANT SPI NOTE: The code in this file expects that the SPI interrupt 
//		flag (ENC_SPI_IF) be clear at all times.  If the SPI is shared with 
//		other hardware, the other code should clear the ENC_SPI_IF when it is 
//		done using the SPI.

// Since the ENC28J60 doesn't support auto-negotiation, full-duplex mode is 
// not compatible with most switches/routers.  If a dedicated network is used 
// where the duplex of the remote node can be manually configured, you may 
// change this configuration.  Otherwise, half duplex should always be used.
#define HALF_DUPLEX
//#define FULL_DUPLEX
//#define LEDB_DUPLEX

// Pseudo Functions
#define LOW(a) 					(a & 0xFF)
#define HIGH(a) 				((a>>8) & 0xFF)

// ENC28J60 Opcodes (to be ORed with a 5 bit address)
#define	WCR (0x02 << 5)			// Write Control Register command
#define BFS (0x04 << 5)			// Bit Field Set command
#define	BFC (0x05 << 5)			// Bit Field Clear command
#define	RCR (0x00 << 5)			// Read Control Register command
#define RBM ((0x01 << 5) | 0x1A)	// Read Buffer Memory command
#define	WBM ((0x03 << 5) | 0x1A) // Write Buffer Memory command
#define	SR  ((0x07 << 5) | 0x1F)	// System Reset command does not use an address.  
//   It requires 0x1F, however.

#define ETHER_IP	(0x00u)
#define ETHER_ARP	(0x06u)

// A header appended at the start of all RX frames by the hardware

typedef struct _ENC_PREAMBLE {
    WORD NextPacketPointer;
    RXSTATUS StatusVector;

    MAC_ADDR DestMACAddr;
    MAC_ADDR SourceMACAddr;
    WORD_VAL Type;
} __attribute__((packed)) ENC_PREAMBLE;


// Prototypes of functions intended for MAC layer use only.
static void BankSel(WORD Register);
static REG ReadETHReg(BYTE Address);
static REG ReadMACReg(BYTE Address);
static void WriteReg(BYTE Address, BYTE Data);
static void BFCReg(BYTE Address, BYTE Data);
static void BFSReg(BYTE Address, BYTE Data);
static void SendSystemReset(void);
//static void GetRegs(void);
//void Get8KBRAM(void);

// Internal MAC level variables and flags.
static WORD_VAL NextPacketLocation;
static WORD_VAL CurrentPacketLocation;
static BOOL WasDiscarded;
static BYTE ENCRevID;



/*************************************************************
 * EN28J60 SPI functions
 *************************************************************/
#if defined(__18CXX)
#define _ENC_SPICON             0x20
#elif defined(__PIC24H__) || defined(__dsPIC33F__)
#define _ENC_SPICON             0x0F
#elif defined(__PIC24F__)
#define _ENC_SPICON             0x1B
#else
#define _ENC_SPICON             0x17
#endif

/*************************************************************
 * EN28J60 SPI Open
 *************************************************************/
inline void SPIOpen(void) {
#ifdef EXPLORER_16
    mSetSPILatch();
#endif
    // Set up SPI
#ifdef __PIC32MX__

#ifdef _ENC_USE_SPI_1
    OpenSPI1(0x013F, 0x8000);
#else
    OpenSPI2(0x013F, 0x8000);
#endif

#elif defined(__18CXX)
    ENC_SPICON1 = _ENC_SPICON;
    ENC_SPI_IF = 0;
    ENC_SPISTATbits.CKE = 1; // Transmit data on rising edge of clock
    ENC_SPISTATbits.SMP = 0; // Input sampled at middle of data output time
#else
    ENC_SPISTAT = 0; // clear SPI
    ENC_SPICON1 = _ENC_SPICON;
    ENC_SPICON1bits.CKE = 1;
    ENC_SPICON1bits.MSTEN = 1;
    ENC_SPISTATbits.SPIEN = 1;
#endif

}

/*************************************************************
 * EN28J60 SPI Byte Transfer
 *************************************************************/
BYTE ByteTransfer(BYTE data) {
    BYTE result;

