whiteway11890/PIC32_Dev/Firmware/Ethernet/src/ENC28J60.c
#ifdef __PIC32MX__

#ifdef _ENC_USE_SPI_1
    putcSPI1((unsigned int) data);
    while (!(SPI1STATbits.SPIRBF)); // wait receive data availables
    result = (BYTE) getcSPI1();
#else
    putcSPI2((unsigned int) data);
    result = (BYTE) getcSPI2();
#endif
#else
    ENC_SPI_IF = 0;
    ENC_SSPBUF = data;
    while (!ENC_SPI_IF); // Wait until opcode/address is transmitted.
    result = ENC_SSPBUF;
    ENC_SPI_IF = 0;
#endif
    return result;

}

//NOTE: All code in this module expect Bank 0 to be currently selected.  If code ever changes the bank, it must restore it to Bank 0 before returning.

/******************************************************************************
 * Function:        void MACInit(void)
 *
 * PreCondition:    None
 *
 * Input:           None
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        MACInit sets up the PIC's SPI module and all the 
 *					registers in the ENC28J60 so that normal operation can 
 *					begin.
 *
 * Note:            None
 *****************************************************************************/
void MACInit(void) {
    BYTE i;

    // Set up the SPI module on the PIC for communications with the ENC28J60
    ENC_CS_IO = 1;
    ENC_CS_TRIS = 0; // Make the Chip Select pin an output
    //ENC_SCK_TRIS = 0;
    //ENC_SDO_TRIS = 0;
    //ENC_SDI_TRIS = 1;

    //SPIOpen();

    // Wait for CLKRDY to become set.
    // Bit 3 in ESTAT is an unimplemented bit.  If it reads out as '1' that
    // means the part is in RESET or there is something wrong with the SPI
    // connection.  This loop makes sure that we can communicate with the
    // ENC28J60 before proceeding.
    do {
        i = ReadETHReg(ESTAT).Val;
    } while ((i & 0x08) || (~i & ESTAT_CLKRDY));

    LED_PUT(0x02);
    // RESET the entire ENC28J60, clearing all registers
    SendSystemReset();
    DelayMs(1);

    // Start up in Bank 0 and configure the receive buffer boundary pointers
    // and the buffer write protect pointer (receive buffer read pointer)
    WasDiscarded = TRUE;
    NextPacketLocation.Val = RXSTART;

    WriteReg(ERXSTL, LOW(RXSTART));
    WriteReg(ERXSTH, HIGH(RXSTART));
    WriteReg(ERXRDPTL, LOW(RXSTOP)); // Write low byte first
    WriteReg(ERXRDPTH, HIGH(RXSTOP)); // Write high byte last
    WriteReg(ERXNDL, LOW(RXSTOP));
    WriteReg(ERXNDH, HIGH(RXSTOP));
    WriteReg(ETXSTL, LOW(TXSTART));
    WriteReg(ETXSTH, HIGH(TXSTART));

    // Write a permanant per packet control byte of 0x00
    WriteReg(EWRPTL, LOW(TXSTART));
    WriteReg(EWRPTH, HIGH(TXSTART));
    MACPut(0x00);


    // Enter Bank 1 and configure Receive Filters
    // (No need to reconfigure - Unicast OR Broadcast with CRC checking is
    // acceptable)
    // Write ERXFCON_CRCEN only to ERXFCON to enter promiscuous mode

    // Promiscious mode example:
    //BankSel(ERXFCON);
    //WriteReg((BYTE)ERXFCON, ERXFCON_CRCEN);

    // Enter Bank 2 and configure the MAC
    BankSel(MACON1);

    // Enable the receive portion of the MAC
    WriteReg((BYTE) MACON1, MACON1_TXPAUS | MACON1_RXPAUS | MACON1_MARXEN);

    // Pad packets to 60 bytes, add CRC, and check Type/Length field.
#if defined(FULL_DUPLEX)
    WriteReg((BYTE) MACON3, MACON3_PADCFG0 | MACON3_TXCRCEN | MACON3_FRMLNEN | MACON3_FULDPX);
    WriteReg((BYTE) MABBIPG, 0x15);
#else
    WriteReg((BYTE) MACON3, MACON3_PADCFG0 | MACON3_TXCRCEN | MACON3_FRMLNEN);
    WriteReg((BYTE) MABBIPG, 0x12);
#endif

    // Allow infinite deferals if the medium is continuously busy 
    // (do not time out a transmission if the half duplex medium is 
    // completely saturated with other people's data)
    WriteReg((BYTE) MACON4, MACON4_DEFER);

    // Late collisions occur beyond 63+8 bytes (8 bytes for preamble/start of frame delimiter)
    // 55 is all that is needed for IEEE 802.3, but ENC28J60 B5 errata for improper link pulse
    // collisions will occur less often with a larger number.
    WriteReg((BYTE) MACLCON2, 63);

    // Set non-back-to-back inter-packet gap to 9.6us.  The back-to-back
    // inter-packet gap (MABBIPG) is set by MACSetDuplex() which is called
    // later.
    WriteReg((BYTE) MAIPGL, 0x12);
    WriteReg((BYTE) MAIPGH, 0x0C);

    // Set the maximum packet size which the controller will accept
    WriteReg((BYTE) MAMXFLL, LOW(6 + 6 + 2 + 1500 + 4)); // 1518 is the IEEE 802.3 specified limit
    WriteReg((BYTE) MAMXFLH, HIGH(6 + 6 + 2 + 1500 + 4)); // 1518 is the IEEE 802.3 specified limit

    // Enter Bank 3 and initialize physical MAC address registers
    BankSel(MAADR1);
    WriteReg((BYTE) MAADR1, AppConfig.MyMACAddr.v[0]);
    WriteReg((BYTE) MAADR2, AppConfig.MyMACAddr.v[1]);
    WriteReg((BYTE) MAADR3, AppConfig.MyMACAddr.v[2]);
    WriteReg((BYTE) MAADR4, AppConfig.MyMACAddr.v[3]);
    WriteReg((BYTE) MAADR5, AppConfig.MyMACAddr.v[4]);
    WriteReg((BYTE) MAADR6, AppConfig.MyMACAddr.v[5]);

    // Disable the CLKOUT output to reduce EMI generation
    WriteReg((BYTE) ECOCON, 0x00); // Output off (0V)
    //WriteReg((BYTE)ECOCON, 0x01);	// 25.000MHz
    //WriteReg((BYTE)ECOCON, 0x03);	// 8.3333MHz (*4 with PLL is 33.3333MHz)

    // Get the Rev ID so that we can implement the correct errata workarounds
    ENCRevID = ReadETHReg((BYTE) EREVID).Val;

    // Disable half duplex loopback in PHY.  Bank bits changed to Bank 2 as a
    // side effect.
    WritePHYReg(PHCON2, PHCON2_HDLDIS);

    // Configure LEDA to display LINK status, LEDB to display TX/RX activity
    SetLEDConfig(0x3472);

    // Set the MAC and PHY into the proper duplex state
#if defined(FULL_DUPLEX)
    WritePHYReg(PHCON1, PHCON1_PDPXMD);
#elif defined(HALF_DUPLEX)
    WritePHYReg(PHCON1, 0x0000);
#else
    // Use the external LEDB polarity to determine weather full or half duplex
    // communication mode should be set.
    {
        REG Register;
        PHYREG PhyReg;

        // Read the PHY duplex mode
        PhyReg = ReadPHYReg(PHCON1);
        DuplexState = PhyReg.PHCON1bits.PDPXMD;

        // Set the MAC to the proper duplex mode
        BankSel(MACON3);
        Register = ReadMACReg((BYTE) MACON3);
        Register.MACON3bits.FULDPX = PhyReg.PHCON1bits.PDPXMD;
        WriteReg((BYTE) MACON3, Register.Val);

