whiteway11890/PIC32_Dev/Firmware/Ethernet/src/ENC28J60.c
    while (len) {
        // Obtain a chunk of data (less SPI overhead compared
        // to requesting one byte at a time)
        ChunkLen = len > sizeof (DataBuffer) ? sizeof (DataBuffer) : len;
        MACGetArray(DataBuffer, ChunkLen);

        len -= ChunkLen;

        // Take care of a last odd numbered data byte
        if (((WORD_VAL*) & ChunkLen)->bits.b0) {
            DataBuffer[ChunkLen] = 0x00;
            ChunkLen++;
        }

        // Calculate the checksum over this chunk
        DataPtr = (WORD*) & DataBuffer[0];
        while (ChunkLen) {
            Checksum.Val += *DataPtr++;
            ChunkLen -= 2;
        }
    }

    // Restore old read pointer location
    WriteReg(ERDPTL, Start.v[0]);
    WriteReg(ERDPTH, Start.v[1]);

    // Do an end-around carry (one's complement arrithmatic)
    Checksum.Val = (DWORD) Checksum.w[0] + (DWORD) Checksum.w[1];

    // Do another end-around carry in case if the prior add
    // caused a carry out
    Checksum.w[0] += Checksum.w[1];

    // Return the resulting checksum
    return ~Checksum.w[0];
}

/******************************************************************************
 * Function:        void MACMemCopyAsync(WORD destAddr, WORD sourceAddr, WORD len)
 *
 * PreCondition:    SPI bus must be initialized (done in MACInit()).
 *
 * Input:           destAddr:	Destination address in the Ethernet memory to 
 *								copy to.  If the MSb is set, the current EWRPT 
 *								value will be used instead.
 *					sourceAddr:	Source address to read from.  If the MSb is 
 *								set, the current ERDPT value will be used 
 *								instead.
 *					len:		Number of bytes to copy
 *
 * Output:          Byte read from the ENC28J60's RAM
 *
 * Side Effects:    None
 *
 * Overview:        Bytes are asynchrnously transfered within the buffer.  Call 
 *					MACIsMemCopyDone() to see when the transfer is complete.  
 *
 * Note:            If a prior transfer is already in progress prior to 
 *					calling this function, this function will block until it 
 *					can start this transfer.
 *
 *					If a negative value is used for the sourceAddr or destAddr 
 *					parameters, then that pointer will get updated with the 
 *					next address after the read or write.
 *****************************************************************************/
void MACMemCopyAsync(PTR_BASE destAddr, PTR_BASE sourceAddr, WORD len) {
    WORD_VAL ReadSave, WriteSave;
    BOOL UpdateWritePointer = FALSE;
    BOOL UpdateReadPointer = FALSE;

    if (((WORD_VAL*) & destAddr)->bits.b15) {
        UpdateWritePointer = TRUE;
        ((WORD_VAL*) & destAddr)->v[0] = ReadETHReg(EWRPTL).Val;
        ((WORD_VAL*) & destAddr)->v[1] = ReadETHReg(EWRPTH).Val;
    }
    if (((WORD_VAL*) & sourceAddr)->bits.b15) {
        UpdateReadPointer = TRUE;
        ((WORD_VAL*) & sourceAddr)->v[0] = ReadETHReg(ERDPTL).Val;
        ((WORD_VAL*) & sourceAddr)->v[1] = ReadETHReg(ERDPTH).Val;
    }

    // Handle special conditions where len == 0 or len == 1
    // The DMA module is not capable of handling those corner cases
    if (len <= 1u) {
        if (!UpdateReadPointer) {
            ReadSave.v[0] = ReadETHReg(ERDPTL).Val;
            ReadSave.v[1] = ReadETHReg(ERDPTH).Val;
        }
        if (!UpdateWritePointer) {
            WriteSave.v[0] = ReadETHReg(EWRPTL).Val;
            WriteSave.v[1] = ReadETHReg(EWRPTH).Val;
        }
        WriteReg(ERDPTL, ((WORD_VAL*) & sourceAddr)->v[0]);
        WriteReg(ERDPTH, ((WORD_VAL*) & sourceAddr)->v[1]);
        WriteReg(EWRPTL, ((WORD_VAL*) & destAddr)->v[0]);
        WriteReg(EWRPTH, ((WORD_VAL*) & destAddr)->v[1]);
        while (len--)
            MACPut(MACGet());
        if (!UpdateReadPointer) {
            WriteReg(ERDPTL, ReadSave.v[0]);
            WriteReg(ERDPTH, ReadSave.v[1]);
        }
        if (!UpdateWritePointer) {
            WriteReg(EWRPTL, WriteSave.v[0]);
            WriteReg(EWRPTH, WriteSave.v[1]);
        }
    } else {
        if (UpdateWritePointer) {
            WriteSave.Val = destAddr + len;
            WriteReg(EWRPTL, WriteSave.v[0]);
            WriteReg(EWRPTH, WriteSave.v[1]);
        }
        len += sourceAddr - 1;
        while (ReadETHReg(ECON1).ECON1bits.DMAST);
        WriteReg(EDMASTL, ((WORD_VAL*) & sourceAddr)->v[0]);
        WriteReg(EDMASTH, ((WORD_VAL*) & sourceAddr)->v[1]);
        WriteReg(EDMADSTL, ((WORD_VAL*) & destAddr)->v[0]);
        WriteReg(EDMADSTH, ((WORD_VAL*) & destAddr)->v[1]);
        if ((sourceAddr <= RXSTOP) && (len > RXSTOP)) //&& (sourceAddr >= RXSTART))
            len -= RXSIZE;
        WriteReg(EDMANDL, ((WORD_VAL*) & len)->v[0]);
        WriteReg(EDMANDH, ((WORD_VAL*) & len)->v[1]);
        BFCReg(ECON1, ECON1_CSUMEN);
        BFSReg(ECON1, ECON1_DMAST);
        if (UpdateReadPointer) {
            len++;
            if ((sourceAddr <= RXSTOP) && (len > RXSTOP)) //&& (sourceAddr >= RXSTART))
                len -= RXSIZE;
            WriteReg(ERDPTL, ((WORD_VAL*) & len)->v[0]);
            WriteReg(ERDPTH, ((WORD_VAL*) & len)->v[1]);
        }
    }
}

BOOL MACIsMemCopyDone(void) {
    return !ReadETHReg(ECON1).ECON1bits.DMAST;
}

/******************************************************************************
 * Function:        BYTE MACGet()
 *
 * PreCondition:    SPI bus must be initialized (done in MACInit()).
 * 					ERDPT must point to the place to read from.
 *
 * Input:           None
 *
 * Output:          Byte read from the ENC28J60's RAM
 *
 * Side Effects:    None
 *
 * Overview:        MACGet returns the byte pointed to by ERDPT and 
 *					increments ERDPT so MACGet() can be called again.  The 
 *					increment will follow the receive buffer wrapping boundary.
 *
 * Note:            None
 *****************************************************************************/
extern int location;
BYTE MACGet() {
    BYTE data;

    location = 0x600;
    ENC_CS_IO = 0;
    data = ByteTransfer(RBM);
    location = 0x601;
    data = ByteTransfer(0);
    ENC_CS_IO = 1;
    location = 0x602;
    return data;
}//end MACGet

