whiteway11890/PIC32_Dev/Firmware/Ethernet/src/ENC28J60.c
/******************************************************************************
 * Function:        WORD MACGetArray(BYTE *val, WORD len)
 *
 * PreCondition:    SPI bus must be initialized (done in MACInit()).
 * 					ERDPT must point to the place to read from.
 *
 * Input:           *val: Pointer to storage location
 *					len:  Number of bytes to read from the data buffer.
 *
 * Output:          Byte(s) of data read from the data buffer.
 *
 * Side Effects:    None
 *
 * Overview:        Burst reads several sequential bytes from the data buffer 
 *					and places them into local memory.  With SPI burst support, 
 *					it performs much faster than multiple MACGet() calls.
 *					ERDPT is incremented after each byte, following the same 
 *					rules as MACGet().
 *
 * Note:            None
 *****************************************************************************/
extern int location;
WORD MACGetArray(BYTE *val, WORD len) {
    // Debug
#if defined(__18F8722) || \
	defined(__18F8627) || \
	defined(__18F8622) || \
	defined(__18F8572) || \
	defined(__18F6722) || \
	defined(__18F6627) || \
	defined(__18F6622) || \
	defined(__18F6527)
    WORD i;
    BYTE Dummy;

    i = len;
    Dummy = 0xFF;
    while (i--) {
        if (((BYTE_VAL*) & Dummy)->bits.b0) {
            // End bust operation
            ENC_CS_IO = 1;
            ((BYTE_VAL*) & Dummy)->bits.b0 = 0;

            // Start the burst operation
            ENC_CS_IO = 0;
            ByteTransfer(RBM);
        } else
            Dummy = 0xFF;

        *val++ = ByteTransfer(0);
    }

    ENC_CS_IO = 1;

    return len;
#else
    WORD i;

    location = 0x500;
    // Start the burst operation
    ENC_CS_IO = 0;
    ByteTransfer(RBM);
    i = 0;

    // Read the data
    location = 0x600;
    while (i < len) {
        *val++ = ByteTransfer(0);
        i++;
    };

    // Terminate the burst operation
    ENC_CS_IO = 1;

    return i;
#endif
}//end MACGetArray

/******************************************************************************
 * Function:        void MACPut(BYTE val)
 *
 * PreCondition:    SPI bus must be initialized (done in MACInit()).
 * 					EWRPT must point to the location to begin writing.
 *
 * Input:           Byte to write into the ENC28J60 buffer memory
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        MACPut outputs the Write Buffer Memory opcode/constant 
 *					(8 bits) and data to write (8 bits) over the SPI.  
 *					EWRPT is incremented after the write.
 *
 * Note:            None
 *****************************************************************************/
void MACPut(BYTE val) {

    ENC_CS_IO = 0;
    ByteTransfer(WBM);
    ByteTransfer(val);
    ENC_CS_IO = 1;
}//end MACPut

/******************************************************************************
 * Function:        void MACPutArray(BYTE *val, WORD len)
 *
 * PreCondition:    SPI bus must be initialized (done in MACInit()).
 * 					EWRPT must point to the location to begin writing.
 *
 * Input:           *val: Pointer to source of bytes to copy.
 *					len:  Number of bytes to write to the data buffer.
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        MACPutArray writes several sequential bytes to the 
 *					ENC28J60 RAM.  It performs faster than multiple MACPut()
 *					calls.  EWRPT is incremented by len.
 *
 * Note:            None
 *****************************************************************************/
void MACPutArray(BYTE *val, WORD len) {
    // Debug
#if defined(__18F8722) || \
	defined(__18F8627) || \
	defined(__18F8622) || \
	defined(__18F8572) || \
	defined(__18F6722) || \
	defined(__18F6627) || \
	defined(__18F6622) || \
	defined(__18F6527)
    WORD i;
    BYTE Dummy;

    i = len;
    Dummy = 0xFF;
    while (i--) {
        if (((BYTE_VAL*) & Dummy)->bits.b0) {
            // End bust operation
            ENC_CS_IO = 1;
            ((BYTE_VAL*) & Dummy)->bits.b0 = 0;

            // Start the burst operation
            ENC_CS_IO = 0;
            ByteTransfer(WBM);
        } else
            Dummy = 0xFF;

        ByteTransfer(*val++);
    }

    ENC_SPI_IF = 0;
    ENC_CS_IO = 1;

    return;
#else

    // Select the chip and send the proper opcode
    ENC_CS_IO = 0;
    ByteTransfer(WBM);

    // Send the data
    while (len) {
        ByteTransfer(*val++);
        len--; // Decrement after writing to ENC_SSPBUF to increase speed
    };

    // Terminate the burst operation
    ENC_CS_IO = 1;
#endif
}//end MACPutArray

/******************************************************************************
 * Function:        static void SendSystemReset(void)
 *
 * PreCondition:    SPI bus must be initialized (done in MACInit()).
 *
 * Input:           None
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        SendSystemReset sends the System Reset SPI command to 
 *					the Ethernet controller.  It resets all register contents 
 *					(except for ECOCON) and returns the device to the power 
 *					on default state.
 *
 * Note:            None
 *****************************************************************************/
static void SendSystemReset(void) {
    ENC_CS_IO = 0;
    ByteTransfer(SR);
    ENC_CS_IO = 1;
}//end SendSystemReset

/******************************************************************************
 * Function:        REG ReadETHReg(BYTE Address)
 *
 * PreCondition:    SPI bus must be initialized (done in MACInit()).
 * 					Bank select bits must be set corresponding to the register 
 * 					to read from.
 *
 * Input:           5 bit address of the ETH control register to read from.
 *					  The top 3 bits must be 0.
 *
 * Output:          Byte read from the Ethernet controller's ETH register.
 *
 * Side Effects:    None
 *
 * Overview:        ReadETHReg sends the 8 bit RCR opcode/Address byte over 
 *					the SPI and then retrives the register contents in the 
 *					next 8 SPI clocks.
 *
 * Note:            This routine cannot be used to access MAC/MII or PHY 
 *					registers.  Use ReadMACReg() or ReadPHYReg() for that 
 *					purpose.  
 *****************************************************************************/
static REG ReadETHReg(BYTE Address) {
    REG r;

    // Select the chip and send the Read Control Register opcode/address
    ENC_CS_IO = 0;

    ByteTransfer(RCR | Address);
    r.Val = ByteTransfer(0);

    ENC_CS_IO = 1;

    return r;
}//end ReadETHReg

